"""
Программа должна запросить любую фразу и вывести на экран :
     - количество символов в данной фразе.
     - количество слов  в данной фразе.
            Словом может считаться любой набор символов разделенный от
            других пробелом и количеством символов больше или равных 1.
     -* количество гласных в данной фразе. Нельзя использовать if и for.

"""

import re

user_request = input("Введите любую фразу: ").strip().lower()

vowelReg = r"[aeiouаеёиоуыэюя]"

print(len(user_request))

print(len(list(user_request.split(" "))))

print(f"Количество гласных = {len(re.findall(vowelReg, user_request))}")
